ErisdarDemo/Bluetooth-Characteristic/Server/Code/nRF52832/main.c
/**@brief Struct that contains pointers to the encoded advertising data. */
static ble_gap_adv_data_t m_adv_data =
{
    .adv_data =
    {
        .p_data = m_enc_advdata,
        .len    = BLE_GAP_ADV_SET_DATA_SIZE_MAX
    },
    .scan_rsp_data =
    {
        .p_data = m_enc_scan_response_data,
        .len    = BLE_GAP_ADV_SET_DATA_SIZE_MAX

    }
};


/*************************************************************************************************/
/** @fcn	void assert_nrf_callback(uint16_t line_num, const uint8_t * p_file_name)
 *  @brief	function for assert macro callback
 *  @details	will be called in case of an assert in the SoftDevice.
 *
 *  @param      [in] (uint16_t) line_num - Line number of the failing ASSERT call
 *  @param      [in] (const uint8_t *) p_file_name - File name of the failing ASSERT call
 *
 *  @warn     On assert from the SoftDevice, the system can only recover on reset.
 */
/*************************************************************************************************/
void assert_nrf_callback(uint16_t line_num, const uint8_t * p_file_name) {

    app_error_handler(DEAD_BEEF, line_num, p_file_name);

    return;
}


/*************************************************************************************************/
/** @fcn	static void leds_init(void)
 *  @brief	function for the LEDs initialization
 *  @details	initializes all LEDs used by the application
 */
/*************************************************************************************************/
static void leds_init(void) {

    bsp_board_init(BSP_INIT_LEDS);

    return;
}


/*************************************************************************************************/
/** @fcn	static void timers_init(void)
 *  @brief	function for the Timer initialization
 *  @details	initializes the timer module
 */
/*************************************************************************************************/
static void timers_init(void) {

    // Initialize timer module, making it use the scheduler
    ret_code_t err_code = app_timer_init();
    APP_ERROR_CHECK(err_code);

    return;
}


/*************************************************************************************************/
/** @fcn	static void gap_params_init(void)
 *  @brief	function for the GAP initialization
 *  @details	Sets up all necessary GAP params of the device including the device name, 
 *              appearance, and the preferred connection parameters.
 */
/*************************************************************************************************/
static void gap_params_init(void) {

    ret_code_t              err_code;
    ble_gap_conn_params_t   gap_conn_params;
    ble_gap_conn_sec_mode_t sec_mode;

    BLE_GAP_CONN_SEC_MODE_SET_OPEN(&sec_mode);

    err_code = sd_ble_gap_device_name_set(&sec_mode,
                                          (const uint8_t *)DEVICE_NAME,
                                          strlen(DEVICE_NAME));
    APP_ERROR_CHECK(err_code);

    memset(&gap_conn_params, 0, sizeof(gap_conn_params));

    gap_conn_params.min_conn_interval = MIN_CONN_INTERVAL;
    gap_conn_params.max_conn_interval = MAX_CONN_INTERVAL;
    gap_conn_params.slave_latency     = SLAVE_LATENCY;
    gap_conn_params.conn_sup_timeout  = CONN_SUP_TIMEOUT;

    err_code = sd_ble_gap_ppcp_set(&gap_conn_params);
    APP_ERROR_CHECK(err_code);

    return;
}


/*************************************************************************************************/
/** @fcn	static void gatt_init(void)
 *  @brief	function for initializing the GATT module
 *  @details	x
 */
/*************************************************************************************************/
static void gatt_init(void) {

    ret_code_t err_code = nrf_ble_gatt_init(&m_gatt, NULL);
    APP_ERROR_CHECK(err_code);

    return;
}


/*************************************************************************************************/
/** @fcn	static void advertising_init(void)
 *  @brief	function for initializing the Advertising functionality
 *  @details	encodes the required advertising data and passes it to the stack. Also builds a 
 *              structure to be passed to the stack when starting advertising.
 */
/*************************************************************************************************/
static void advertising_init(void) {

    ret_code_t    err_code;
    ble_advdata_t advdata;
    ble_advdata_t srdata;

    ble_uuid_t adv_uuids[] = {{LBS_UUID_SERVICE, m_lbs.uuid_type}};

    // Build and set advertising data.
    memset(&advdata, 0, sizeof(advdata));

    advdata.name_type          = BLE_ADVDATA_FULL_NAME;
    advdata.include_appearance = true;
    advdata.flags              = BLE_GAP_ADV_FLAGS_LE_ONLY_GENERAL_DISC_MODE;


    memset(&srdata, 0, sizeof(srdata));
    srdata.uuids_complete.uuid_cnt = sizeof(adv_uuids) / sizeof(adv_uuids[0]);
    srdata.uuids_complete.p_uuids  = adv_uuids;

    err_code = ble_advdata_encode(&advdata, m_adv_data.adv_data.p_data, &m_adv_data.adv_data.len);
    APP_ERROR_CHECK(err_code);

    err_code = ble_advdata_encode(&srdata, m_adv_data.scan_rsp_data.p_data, &m_adv_data.scan_rsp_data.len);
    APP_ERROR_CHECK(err_code);

    ble_gap_adv_params_t adv_params;

    // Set advertising parameters.
    memset(&adv_params, 0, sizeof(adv_params));

    adv_params.primary_phy     = BLE_GAP_PHY_1MBPS;
    adv_params.duration        = APP_ADV_DURATION;
    adv_params.properties.type = BLE_GAP_ADV_TYPE_CONNECTABLE_SCANNABLE_UNDIRECTED;
    adv_params.p_peer_addr     = NULL;
    adv_params.filter_policy   = BLE_GAP_ADV_FP_ANY;
    adv_params.interval        = APP_ADV_INTERVAL;

    err_code = sd_ble_gap_adv_set_configure(&m_adv_handle, &m_adv_data, &adv_params);
    APP_ERROR_CHECK(err_code);

    return;
}


/*************************************************************************************************/
/** @fcn	static void nrf_qwr_error_handler(uint32_t nrf_error)
 *  @brief	function for handling Queued Write Module errors
 *  @details	a pointer to this function will be passed to each service which may need to 
 *              inform the application about an error.
 *
 *  @param	[in] (uint32_t) nrf_error - Error code containing information about what went wrong.
 */
/*************************************************************************************************/
static void nrf_qwr_error_handler(uint32_t nrf_error) {

    APP_ERROR_HANDLER(nrf_error);

    return;
}


/*************************************************************************************************/
/** @fcn	static void led_write_handler(uint16_t conn_handle, ble_lbs_t * p_lbs, uint8_t led_state)
 *  @brief	function for handling write events to the LED characteristic
 *  @details	x
 *
 *  @param	[in] (uint16_t) conn_handle - x
 *  @param      [in] (ble_lbs_t *) p_lbs - Instance of LED Button Service to which the write applies.
 *  @param      [in] (uint8_t) led_state - Written/desired state of the LED.
 */
/*************************************************************************************************/
static void led_write_handler(uint16_t conn_handle, ble_lbs_t * p_lbs, uint8_t led_state) {

