ErisdarDemo/Bluetooth-Characteristic/Server/Code/nRF52832/main.c
    if (led_state) {
        bsp_board_led_on(LEDBUTTON_LED);
        NRF_LOG_INFO("Received LED ON!");
    } else {
        bsp_board_led_off(LEDBUTTON_LED);
        NRF_LOG_INFO("Received LED OFF!");
    }

    return;
}


/*************************************************************************************************/
/** @fcn	static void services_init(void)
 *  @brief	function for initializing services that will be used by the application
 *  @details	x
 */
/*************************************************************************************************/
static void services_init(void) {

    ret_code_t         err_code;
    ble_lbs_init_t     init     = {0};
    nrf_ble_qwr_init_t qwr_init = {0};

    // Initialize Queued Write Module.
    qwr_init.error_handler = nrf_qwr_error_handler;

    err_code = nrf_ble_qwr_init(&m_qwr, &qwr_init);
    APP_ERROR_CHECK(err_code);

    // Initialize LBS.
    init.led_write_handler = led_write_handler;

    err_code = ble_lbs_init(&m_lbs, &init);
    APP_ERROR_CHECK(err_code);

    return;
}


/*************************************************************************************************/
/** @fcn	static void on_conn_params_evt(ble_conn_params_evt_t * p_evt)
 *  @brief	function for handling the Connection Parameters Module
 *  @details	this function will be called for all events in the Connection Parameters Module 
 *              that are passed to the application
 *
 *  @param	[in] (ble_conn_params_evt_t *) p_evt - Event received from the Connection 
                                                       Parameters Module
 *
 *  @section	Note
 *  	All this function does is to disconnect. This could have been done by simply setting the 
 *      disconnect_on_fail config parameter, but instead we use the event handler mechanism to 
 *      demonstrate its use.
 */
/*************************************************************************************************/
static void on_conn_params_evt(ble_conn_params_evt_t * p_evt) {

    ret_code_t err_code;

    if (p_evt->evt_type == BLE_CONN_PARAMS_EVT_FAILED) {
        err_code = sd_ble_gap_disconnect(m_conn_handle, BLE_HCI_CONN_INTERVAL_UNACCEPTABLE);
        APP_ERROR_CHECK(err_code);
    }

    return;
}


/*************************************************************************************************/
/** @fcn	static void conn_params_error_handler(uint32_t nrf_error)
 *  @brief	function for handling a Connection Parameters error
 *  @details	x
 *
 *  @param	[in] (uint32_t)  nrf_error - Error code containing information about what went wrong
 */
/*************************************************************************************************/
static void conn_params_error_handler(uint32_t nrf_error) {

    APP_ERROR_HANDLER(nrf_error);

    return;
}


/*************************************************************************************************/
/** @fcn	static void conn_params_init(void)
 *  @brief	function for initializing the Connection Parameters module
 *  @details	x
 */
/*************************************************************************************************/
static void conn_params_init(void) {

    ret_code_t             err_code;
    ble_conn_params_init_t cp_init;

    memset(&cp_init, 0, sizeof(cp_init));

    cp_init.p_conn_params                  = NULL;
    cp_init.first_conn_params_update_delay = FIRST_CONN_PARAMS_UPDATE_DELAY;
    cp_init.next_conn_params_update_delay  = NEXT_CONN_PARAMS_UPDATE_DELAY;
    cp_init.max_conn_params_update_count   = MAX_CONN_PARAMS_UPDATE_COUNT;
    cp_init.start_on_notify_cccd_handle    = BLE_GATT_HANDLE_INVALID;
    cp_init.disconnect_on_fail             = false;
    cp_init.evt_handler                    = on_conn_params_evt;
    cp_init.error_handler                  = conn_params_error_handler;

    err_code = ble_conn_params_init(&cp_init);
    APP_ERROR_CHECK(err_code);
    
    return;
}


/*************************************************************************************************/
/** @fcn	static void advertising_start(void)
 *  @brief	function for starting advertising
 *  @details	x
 */
/*************************************************************************************************/
static void advertising_start(void) {

    ret_code_t           err_code;

    err_code = sd_ble_gap_adv_start(m_adv_handle, APP_BLE_CONN_CFG_TAG);
    APP_ERROR_CHECK(err_code);

    bsp_board_led_on(ADVERTISING_LED);

    return;
}


/*************************************************************************************************/
/** @fcn	static void ble_evt_handler(ble_evt_t const * p_ble_evt, void * p_context)
 *  @brief	function for handling BLE events
 *  @details	x
 *
 *  @param      [in] (ble_evt_t const *) p_ble_evt - Bluetooth stack event
 *  @param      [in] (void *) p_context - Unused
 */
/*************************************************************************************************/
static void ble_evt_handler(ble_evt_t const * p_ble_evt, void * p_context) {

    ret_code_t err_code;

    switch (p_ble_evt->header.evt_id) {
        case BLE_GAP_EVT_CONNECTED:
            NRF_LOG_INFO("Connected");
            bsp_board_led_on(CONNECTED_LED);
            bsp_board_led_off(ADVERTISING_LED);
            m_conn_handle = p_ble_evt->evt.gap_evt.conn_handle;
            err_code = nrf_ble_qwr_conn_handle_assign(&m_qwr, m_conn_handle);
            APP_ERROR_CHECK(err_code);
            err_code = app_button_enable();
            APP_ERROR_CHECK(err_code);
            break;

        case BLE_GAP_EVT_DISCONNECTED:
            NRF_LOG_INFO("Disconnected");
            bsp_board_led_off(CONNECTED_LED);
            m_conn_handle = BLE_CONN_HANDLE_INVALID;
            err_code = app_button_disable();
            APP_ERROR_CHECK(err_code);
            advertising_start();
            break;

        case BLE_GAP_EVT_SEC_PARAMS_REQUEST:
            // Pairing not supported
            err_code = sd_ble_gap_sec_params_reply(m_conn_handle,
                                                   BLE_GAP_SEC_STATUS_PAIRING_NOT_SUPP,
                                                   NULL,
                                                   NULL);
            APP_ERROR_CHECK(err_code);
            break;

        case BLE_GAP_EVT_PHY_UPDATE_REQUEST: {
            NRF_LOG_DEBUG("PHY update request.");
            ble_gap_phys_t const phys =
            {
                .rx_phys = BLE_GAP_PHY_AUTO,
                .tx_phys = BLE_GAP_PHY_AUTO,
            };
            err_code = sd_ble_gap_phy_update(p_ble_evt->evt.gap_evt.conn_handle, &phys);
            APP_ERROR_CHECK(err_code);
        } break;

        case BLE_GATTS_EVT_SYS_ATTR_MISSING:
            // No system attributes have been stored.
            err_code = sd_ble_gatts_sys_attr_set(m_conn_handle, NULL, 0, 0);
            APP_ERROR_CHECK(err_code);
            break;

        case BLE_GATTC_EVT_TIMEOUT:
            // Disconnect on GATT Client timeout event.
            NRF_LOG_DEBUG("GATT Client Timeout.");
            err_code = sd_ble_gap_disconnect(p_ble_evt->evt.gattc_evt.conn_handle,
                                             BLE_HCI_REMOTE_USER_TERMINATED_CONNECTION);
            APP_ERROR_CHECK(err_code);
            break;

        case BLE_GATTS_EVT_TIMEOUT:
            // Disconnect on GATT Server timeout event.
            NRF_LOG_DEBUG("GATT Server Timeout.");
            err_code = sd_ble_gap_disconnect(p_ble_evt->evt.gatts_evt.conn_handle,
                                             BLE_HCI_REMOTE_USER_TERMINATED_CONNECTION);
            APP_ERROR_CHECK(err_code);
            break;

        default:
            // No implementation needed.
            break;
    }

    return;
}


/*************************************************************************************************/
/** @fcn	static void ble_stack_init(void)
 *  @brief	function for initializing the BLE stack
 *  @details	initializes the SoftDevice and the BLE event interrupt
 */
/*************************************************************************************************/
static void ble_stack_init(void) {

    ret_code_t err_code;

    err_code = nrf_sdh_enable_request();
    APP_ERROR_CHECK(err_code);

    // Configure the BLE stack using the default settings.
    // Fetch the start address of the application RAM.
    uint32_t ram_start = 0;
    err_code = nrf_sdh_ble_default_cfg_set(APP_BLE_CONN_CFG_TAG, &ram_start);
    APP_ERROR_CHECK(err_code);

    // Enable BLE stack.
    err_code = nrf_sdh_ble_enable(&ram_start);
    APP_ERROR_CHECK(err_code);

    // Register a handler for BLE events.
    NRF_SDH_BLE_OBSERVER(m_ble_observer, APP_BLE_OBSERVER_PRIO, ble_evt_handler, NULL);

    return;
}


/*************************************************************************************************/
/** @fcn	static void button_event_handler(uint8_t pin_no, uint8_t button_action)
 *  @brief	function for handling events from the button handler module
 *  @details	x
 *
 *  @param      [in] (uint8_t) pin_no - pin that the event applies to
 *  @param      [in] (uint8_t) button_action - the button action (press/release)
 */
/*************************************************************************************************/
static void button_event_handler(uint8_t pin_no, uint8_t button_action) {

    ret_code_t err_code;

    switch (pin_no) {
        case LEDBUTTON_BUTTON:
            NRF_LOG_INFO("Send button state change.");
            err_code = ble_lbs_on_button_change(m_conn_handle, &m_lbs, button_action);
            if (err_code != NRF_SUCCESS &&
                err_code != BLE_ERROR_INVALID_CONN_HANDLE &&
                err_code != NRF_ERROR_INVALID_STATE &&
                err_code != BLE_ERROR_GATTS_SYS_ATTR_MISSING)
            {
                APP_ERROR_CHECK(err_code);
            }
            break;

        default:
            APP_ERROR_HANDLER(pin_no);
            break;
    }

    return;
}


/*************************************************************************************************/
/** @fcn	static void buttons_init(void)
 *  @brief	function for initializing the button handler module
 *  @details	x
 */
/*************************************************************************************************/
static void buttons_init(void) {

    ret_code_t err_code;

    //The array must be static because a pointer to it will be saved in the button handler module.
    static app_button_cfg_t buttons[] =
    {
        {LEDBUTTON_BUTTON, false, BUTTON_PULL, button_event_handler}
    };

    err_code = app_button_init(buttons, ARRAY_SIZE(buttons),
                               BUTTON_DETECTION_DELAY);
    APP_ERROR_CHECK(err_code);

    return;
}


/*************************************************************************************************/
/** @fcn	static void log_init(void)
 *  @brief	x
 *  @details	x
 */
/*************************************************************************************************/
static void log_init(void) {

