ErisdarDemo/Bluetooth-Characteristic/Server/Code/nRF52832/main.c
    ret_code_t err_code = NRF_LOG_INIT(NULL);
    APP_ERROR_CHECK(err_code);

    NRF_LOG_DEFAULT_BACKENDS_INIT();

    return;
}


/*************************************************************************************************/
/** @fcn	static void power_management_init(void)
 *  @brief	function for initializing power management
 *  @details	x
 */
/*************************************************************************************************/
static void power_management_init(void) {

    ret_code_t err_code;
    err_code = nrf_pwr_mgmt_init();
    APP_ERROR_CHECK(err_code);

    return;
}


/*************************************************************************************************/
/** @fcn	static void idle_state_handle(void)
 *  @brief	function for handling the idle state (main loop)
 *  @details	if there is no pending log operation, then sleep until next the next event occurs
 */
/*************************************************************************************************/
static void idle_state_handle(void) {

    if (NRF_LOG_PROCESS() == false) {
        nrf_pwr_mgmt_run();
    }

    return;
}


/*************************************************************************************************/
/** @fcn	int main(void)
 *  @brief	function for application main entry
 *  @details	x
 *		
 *  @section	Opens
 *     stdComments
 *     printf on activities
 *     activities for all buttons
 *     ...!
 */
/*************************************************************************************************/
int main(void) {

    // Initialize.
    log_init();
    leds_init();
    timers_init();
    buttons_init();
    power_management_init();
    ble_stack_init();
    gap_params_init();
    gatt_init();
    services_init();
    advertising_init();
    conn_params_init();

    // Start execution.
    NRF_LOG_INFO("Blinky example started.");
    advertising_start();

    // Enter main loop.
    for (;;) {
        idle_state_handle();
    }
}

